artillery.yml
config:
  http:
    pool:10
  environments:
    local:
  target: 'http://13.56.14.51:3001'
  phases:
    - duration: 20
      arrivalRate: 25
    # - duration: 40
    #   arrivalRate: 40
    # - duration: 60
    #   arrivalRate: 60
  defaults:
    headers:
scenarios:
  - name: "pageload"
    flow:
      - loop:
        - get:
            url: "/api/restaurants/{{$randomNumber(1,10000000)}}/gallery"
        count: 4