artillery.yml
config:
  http:
    pool:10
  environments:
    local:
  target: 'http://localhost:3001'
  phases:
    - duration: 20
      arrivalRate: 15
    - duration: 40
      arrivalRate: 5
    - duration: 60
      arrivalRate: 25
  defaults:
    headers:
scenarios:
  - name: "pageload"
    flow:
      - loop:
        - get:
            url: "/restaurants/{{$randomNumber(1,10000000)}}/gallery"
        count: 4